HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxScu_regdef.h
/** \\brief  System Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_SYSCON_Bits B;
} Ifx_SCU_SYSCON;

/** \\brief  Trap Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_TRAPCLR_Bits B;
} Ifx_SCU_TRAPCLR;

/** \\brief  Trap Disable Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_TRAPDIS_Bits B;
} Ifx_SCU_TRAPDIS;

/** \\brief  Trap Set Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_TRAPSET_Bits B;
} Ifx_SCU_TRAPSET;

/** \\brief  Trap Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_TRAPSTAT_Bits B;
} Ifx_SCU_TRAPSTAT;

/** \\brief  CPU WDT Control Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_WDTCPU_CON0_Bits B;
} Ifx_SCU_WDTCPU_CON0;

/** \\brief  CPU WDT Control Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_WDTCPU_CON1_Bits B;
} Ifx_SCU_WDTCPU_CON1;

/** \\brief  CPU WDT Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_WDTCPU_SR_Bits B;
} Ifx_SCU_WDTCPU_SR;

/** \\brief  Safety WDT Control Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_WDTS_CON0_Bits B;
} Ifx_SCU_WDTS_CON0;

/** \\brief  Safety WDT Control Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_WDTS_CON1_Bits B;
} Ifx_SCU_WDTS_CON1;

/** \\brief  Safety WDT Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_WDTS_SR_Bits B;
} Ifx_SCU_WDTS_SR;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Scu_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \\brief  CPU watchdog */
typedef volatile struct _Ifx_SCU_WDTCPU
{
    Ifx_SCU_WDTCPU_CON0 CON0;               /**< \brief 0, CPU WDT Control Register 0 */
    Ifx_SCU_WDTCPU_CON1 CON1;               /**< \brief 4, CPU WDT Control Register 1 */
    Ifx_SCU_WDTCPU_SR SR;                   /**< \brief 8, CPU WDT Status Register */
} Ifx_SCU_WDTCPU;

/** \\brief  Safety watchdog */
typedef volatile struct _Ifx_SCU_WDTS
{
    Ifx_SCU_WDTS_CON0 CON0;                 /**< \brief 0, Safety WDT Control Register 0 */
    Ifx_SCU_WDTS_CON1 CON1;                 /**< \brief 4, Safety WDT Control Register 1 */
    Ifx_SCU_WDTS_SR SR;                     /**< \brief 8, Safety WDT Status Register */
} Ifx_SCU_WDTS;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Scu_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  SCU object */
typedef volatile struct _Ifx_SCU
{
    unsigned char reserved_0[8];            /**< \brief 0, \internal Reserved */
    Ifx_SCU_ID ID;                          /**< \brief 8, Identification Register */
    unsigned char reserved_C[4];            /**< \brief C, \internal Reserved */
    Ifx_SCU_OSCCON OSCCON;                  /**< \brief 10, OSC Control Register */
    Ifx_SCU_PLLSTAT PLLSTAT;                /**< \brief 14, PLL Status Register */
    Ifx_SCU_PLLCON0 PLLCON0;                /**< \brief 18, PLL Configuration 0 Register */
    Ifx_SCU_PLLCON1 PLLCON1;                /**< \brief 1C, PLL Configuration 1 Register */
    Ifx_SCU_PLLCON2 PLLCON2;                /**< \brief 20, PLL Configuration 2 Register */
    Ifx_SCU_PLLERAYSTAT PLLERAYSTAT;        /**< \brief 24, PLL_ERAY Status Register */
    Ifx_SCU_PLLERAYCON0 PLLERAYCON0;        /**< \brief 28, PLL_ERAY Configuration 0 Register */
    Ifx_SCU_PLLERAYCON1 PLLERAYCON1;        /**< \brief 2C, PLL_ERAY Configuration 1 Register */
    Ifx_SCU_CCUCON0 CCUCON0;                /**< \brief 30, CCU Clock Control Register 0 */
    Ifx_SCU_CCUCON1 CCUCON1;                /**< \brief 34, CCU Clock Control Register 1 */
    Ifx_SCU_FDR FDR;                        /**< \brief 38, Fractional Divider Register */
    Ifx_SCU_EXTCON EXTCON;                  /**< \brief 3C, External Clock Control Register */
    Ifx_SCU_CCUCON2 CCUCON2;                /**< \brief 40, CCU Clock Control Register 2 */
    Ifx_SCU_CCUCON3 CCUCON3;                /**< \brief 44, CCU Clock Control Register 3 */
    Ifx_SCU_CCUCON4 CCUCON4;                /**< \brief 48, CCU Clock Control Register 4 */
    Ifx_SCU_CCUCON5 CCUCON5;                /**< \brief 4C, CCU Clock Control Register 5 */
    Ifx_SCU_RSTSTAT RSTSTAT;                /**< \brief 50, Reset Status Register */
    unsigned char reserved_54[4];           /**< \brief 54, \internal Reserved */
    Ifx_SCU_RSTCON RSTCON;                  /**< \brief 58, Reset Configuration Register */
    Ifx_SCU_ARSTDIS ARSTDIS;                /**< \brief 5C, Application Reset Disable Register */
    Ifx_SCU_SWRSTCON SWRSTCON;              /**< \brief 60, Software Reset Configuration Register */
    Ifx_SCU_RSTCON2 RSTCON2;                /**< \brief 64, Additional Reset Control Register */
    unsigned char reserved_68[4];           /**< \brief 68, \internal Reserved */
    Ifx_SCU_EVRRSTCON EVRRSTCON;            /**< \brief 6C, EVR Reset Control Register */
    Ifx_SCU_ESRCFG ESRCFG[2];               /**< \brief 70, ESR Input Configuration Register */
    Ifx_SCU_ESROCFG ESROCFG;                /**< \brief 78, ESR Output Configuration Register */
    Ifx_SCU_SYSCON SYSCON;                  /**< \brief 7C, System Control Register */
    Ifx_SCU_CCUCON6 CCUCON6;                /**< \brief 80, CCU Clock Control Register 6 */
    Ifx_SCU_CCUCON7 CCUCON7;                /**< \brief 84, CCU Clock Control Register 7 */
    Ifx_SCU_CCUCON8 CCUCON8;                /**< \brief 88, CCU Clock Control Register 8 */
    Ifx_SCU_CCUCON9 CCUCON9;                /**< \brief 8C, CCU Clock Control Register 9 */
    unsigned char reserved_90[12];          /**< \brief 90, \internal Reserved */
    Ifx_SCU_PDR PDR;                        /**< \brief 9C, ESR Pad Driver Mode Register */
    Ifx_SCU_IOCR IOCR;                      /**< \brief A0, Input/Output Control Register */
    Ifx_SCU_OUT OUT;                        /**< \brief A4, ESR Output Register */
    Ifx_SCU_OMR OMR;                        /**< \brief A8, ESR Output Modification Register */
    Ifx_SCU_IN IN;                          /**< \brief AC, ESR Input Register */
    Ifx_SCU_EVRSTAT EVRSTAT;                /**< \brief B0, EVR Status Register */
    Ifx_SCU_EVRDVSTAT EVRDVSTAT;            /**< \brief B4, EVR Status Register for Voltage Scaling */
    Ifx_SCU_EVR13CON EVR13CON;              /**< \brief B8, EVR13 Control Register */
    Ifx_SCU_EVR33CON EVR33CON;              /**< \brief BC, EVR33 Control Register */
    Ifx_SCU_STSTAT STSTAT;                  /**< \brief C0, Start-up Status Register */
    unsigned char reserved_C4[4];           /**< \brief C4, \internal Reserved */
    Ifx_SCU_PMSWCR0 PMSWCR0;                /**< \brief C8, Standby and Wake-up Control Register 0 */
    Ifx_SCU_PMSWSTAT PMSWSTAT;              /**< \brief CC, Standby and Wake-up Status Flag Register */
    Ifx_SCU_PMSWSTATCLR PMSWSTATCLR;        /**< \brief D0, Standby and Wake-up Status Clear Register */
    Ifx_SCU_PMCSR PMCSR[3];                 /**< \brief D4, Power Management Control and Status Register */
    Ifx_SCU_DTSSTAT DTSSTAT;                /**< \brief E0, Die Temperature Sensor Status Register */
    Ifx_SCU_DTSCON DTSCON;                  /**< \brief E4, Die Temperature Sensor Control Register */
    Ifx_SCU_PMSWCR1 PMSWCR1;                /**< \brief E8, Standby and Wake-up Control Register 1 */
    unsigned char reserved_EC[4];           /**< \brief EC, \internal Reserved */
    Ifx_SCU_WDTS WDTS;                      /**< \brief F0, Safety watchdog */
    Ifx_SCU_EMSR EMSR;                      /**< \brief FC, Emergency Stop Register */
    Ifx_SCU_WDTCPU WDTCPU[3];               /**< \brief 100, CPU watchdogs */
    Ifx_SCU_TRAPSTAT TRAPSTAT;              /**< \brief 124, Trap Status Register */
    Ifx_SCU_TRAPSET TRAPSET;                /**< \brief 128, Trap Set Register */
    Ifx_SCU_TRAPCLR TRAPCLR;                /**< \brief 12C, Trap Clear Register */
    Ifx_SCU_TRAPDIS TRAPDIS;                /**< \brief 130, Trap Disable Register */
    Ifx_SCU_LCLCON LCLCON0;                 /**< \brief 134, LCL CPU0 Control Register */
    Ifx_SCU_LCLCON LCLCON1;                 /**< \brief 138, LCL CPU1 Control Register */
    Ifx_SCU_LCLTEST LCLTEST;                /**< \brief 13C, LCL Test Register */
    Ifx_SCU_CHIPID CHIPID;                  /**< \brief 140, Chip Identification Register */
    Ifx_SCU_MANID MANID;                    /**< \brief 144, Manufacturer Identification Register */
    unsigned char reserved_148[8];          /**< \brief 148, \internal Reserved */
    Ifx_SCU_SAFECON SAFECON;                /**< \brief 150, Safety Heartbeat Register */
    unsigned char reserved_154[16];         /**< \brief 154, \internal Reserved */
    Ifx_SCU_LBISTCTRL0 LBISTCTRL0;          /**< \brief 164, Logic BIST Control 0 Register */
    Ifx_SCU_LBISTCTRL1 LBISTCTRL1;          /**< \brief 168, Logic BIST Control 1 Register */
    Ifx_SCU_LBISTCTRL2 LBISTCTRL2;          /**< \brief 16C, Logic BIST Control 2 Register */
    unsigned char reserved_170[28];         /**< \brief 170, \internal Reserved */
    Ifx_SCU_PDISC PDISC;                    /**< \brief 18C, Pad Disable Control Register */
    unsigned char reserved_190[8];          /**< \brief 190, \internal Reserved */
    Ifx_SCU_EVRTRIM EVRTRIM;                /**< \brief 198, EVR Trim Register */
    Ifx_SCU_EVRADCSTAT EVRADCSTAT;          /**< \brief 19C, EVR ADC Status Register */
    Ifx_SCU_EVRUVMON EVRUVMON;              /**< \brief 1A0, EVR Under-voltage Configuration Register */
    Ifx_SCU_EVROVMON EVROVMON;              /**< \brief 1A4, EVR Over-voltage Configuration Register */
    Ifx_SCU_EVRMONCTRL EVRMONCTRL;          /**< \brief 1A8, EVR Monitor Control Register */
    unsigned char reserved_1AC[4];          /**< \brief 1AC, \internal Reserved */
    Ifx_SCU_EVRSDCTRL1 EVRSDCTRL1;          /**< \brief 1B0, EVR13 SD Control Register 1 */
    Ifx_SCU_EVRSDCTRL2 EVRSDCTRL2;          /**< \brief 1B4, EVR13 SD Control Register 2 */
    Ifx_SCU_EVRSDCTRL3 EVRSDCTRL3;          /**< \brief 1B8, EVR13 SD Control Register 3 */
    Ifx_SCU_EVRSDCTRL4 EVRSDCTRL4;          /**< \brief 1BC, EVR13 SD Control Register 4 */
    Ifx_SCU_EVRSDCOEFF1 EVRSDCOEFF1;        /**< \brief 1C0, EVR13 SD Coefficient Register 1 */
    Ifx_SCU_EVRSDCOEFF2 EVRSDCOEFF2;        /**< \brief 1C4, EVR13 SD Coefficient Register 2 */
    Ifx_SCU_EVRSDCOEFF3 EVRSDCOEFF3;        /**< \brief 1C8, EVR13 SD Coefficient Register 3 */
    Ifx_SCU_EVRSDCOEFF4 EVRSDCOEFF4;        /**< \brief 1CC, EVR13 SD Coefficient Register 4 */
    Ifx_SCU_EVRSDCOEFF5 EVRSDCOEFF5;        /**< \brief 1D0, EVR13 SD Coefficient Register 5 */
    Ifx_SCU_EVRSDCOEFF6 EVRSDCOEFF6;        /**< \brief 1D4, EVR13 SD Coefficient Register 6 */
    Ifx_SCU_EVROSCCTRL EVROSCCTRL;          /**< \brief 1D8, EVR Oscillator & Bandgap Register */
    unsigned char reserved_1DC[4];          /**< \brief 1DC, \internal Reserved */
    Ifx_SCU_OVCENABLE OVCENABLE;            /**< \brief 1E0, Overlay Enable Register */
    Ifx_SCU_OVCCON OVCCON;                  /**< \brief 1E4, Overlay Control Register */
    unsigned char reserved_1E8[40];         /**< \brief 1E8, \internal Reserved */
    Ifx_SCU_EICR EICR[4];                   /**< \brief 210, External Input Channel Register  */
    Ifx_SCU_EIFR EIFR;                      /**< \brief 220, External Input Flag Register */
    Ifx_SCU_FMR FMR;                        /**< \brief 224, Flag Modification Register */
    Ifx_SCU_PDRR PDRR;                      /**< \brief 228, Pattern Detection Result Register */
    Ifx_SCU_IGCR IGCR[4];                   /**< \brief 22C, Flag Gating Register  */
    unsigned char reserved_23C[4];          /**< \brief 23C, \internal Reserved */
    Ifx_SCU_DTSLIM DTSLIM;                  /**< \brief 240, Die Temperature Sensor Limit Register */
    unsigned char reserved_244[436];        /**< \brief 244, \internal Reserved */
    Ifx_SCU_ACCEN1 ACCEN1;                  /**< \brief 3F8, Access Enable Register 1 */
    Ifx_SCU_ACCEN0 ACCEN0;                  /**< \brief 3FC, Access Enable Register 0 */
} Ifx_SCU;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXSCU_REGDEF_H */
